SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_protimer.h
/* Bit fields for PROTIMER EN */
#define _PROTIMER_EN_RESETVALUE                          0x00000000UL                   /**< Default value for PROTIMER_EN               */
#define _PROTIMER_EN_MASK                                0x00000001UL                   /**< Mask for PROTIMER_EN                        */
#define PROTIMER_EN_EN                                   (0x1UL << 0)                   /**< EN                                          */
#define _PROTIMER_EN_EN_SHIFT                            0                              /**< Shift value for PROTIMER_EN                 */
#define _PROTIMER_EN_EN_MASK                             0x1UL                          /**< Bit mask for PROTIMER_EN                    */
#define _PROTIMER_EN_EN_DEFAULT                          0x00000000UL                   /**< Mode DEFAULT for PROTIMER_EN                */
#define PROTIMER_EN_EN_DEFAULT                           (_PROTIMER_EN_EN_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_EN        */

/* Bit fields for PROTIMER CTRL */
#define _PROTIMER_CTRL_RESETVALUE                        0x00000000UL                                  /**< Default value for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_MASK                              0x3FF33336UL                                  /**< Mask for PROTIMER_CTRL                      */
#define PROTIMER_CTRL_DEBUGRUN                           (0x1UL << 1)                                  /**< Debug Mode Run Enable                       */
#define _PROTIMER_CTRL_DEBUGRUN_SHIFT                    1                                             /**< Shift value for PROTIMER_DEBUGRUN           */
#define _PROTIMER_CTRL_DEBUGRUN_MASK                     0x2UL                                         /**< Bit mask for PROTIMER_DEBUGRUN              */
#define _PROTIMER_CTRL_DEBUGRUN_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_DEBUGRUN_X0                       0x00000000UL                                  /**< Mode X0 for PROTIMER_CTRL                   */
#define _PROTIMER_CTRL_DEBUGRUN_X1                       0x00000001UL                                  /**< Mode X1 for PROTIMER_CTRL                   */
#define PROTIMER_CTRL_DEBUGRUN_DEFAULT                   (_PROTIMER_CTRL_DEBUGRUN_DEFAULT << 1)        /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_DEBUGRUN_X0                        (_PROTIMER_CTRL_DEBUGRUN_X0 << 1)             /**< Shifted mode X0 for PROTIMER_CTRL           */
#define PROTIMER_CTRL_DEBUGRUN_X1                        (_PROTIMER_CTRL_DEBUGRUN_X1 << 1)             /**< Shifted mode X1 for PROTIMER_CTRL           */
#define PROTIMER_CTRL_DMACLRACT                          (0x1UL << 2)                                  /**< DMA Request Clear on Active                 */
#define _PROTIMER_CTRL_DMACLRACT_SHIFT                   2                                             /**< Shift value for PROTIMER_DMACLRACT          */
#define _PROTIMER_CTRL_DMACLRACT_MASK                    0x4UL                                         /**< Bit mask for PROTIMER_DMACLRACT             */
#define _PROTIMER_CTRL_DMACLRACT_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define PROTIMER_CTRL_DMACLRACT_DEFAULT                  (_PROTIMER_CTRL_DMACLRACT_DEFAULT << 2)       /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_OSMEN                              (0x1UL << 4)                                  /**< One-Shot Mode Enable                        */
#define _PROTIMER_CTRL_OSMEN_SHIFT                       4                                             /**< Shift value for PROTIMER_OSMEN              */
#define _PROTIMER_CTRL_OSMEN_MASK                        0x10UL                                        /**< Bit mask for PROTIMER_OSMEN                 */
#define _PROTIMER_CTRL_OSMEN_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_OSMEN_X0                          0x00000000UL                                  /**< Mode X0 for PROTIMER_CTRL                   */
#define _PROTIMER_CTRL_OSMEN_X1                          0x00000001UL                                  /**< Mode X1 for PROTIMER_CTRL                   */
#define PROTIMER_CTRL_OSMEN_DEFAULT                      (_PROTIMER_CTRL_OSMEN_DEFAULT << 4)           /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_OSMEN_X0                           (_PROTIMER_CTRL_OSMEN_X0 << 4)                /**< Shifted mode X0 for PROTIMER_CTRL           */
#define PROTIMER_CTRL_OSMEN_X1                           (_PROTIMER_CTRL_OSMEN_X1 << 4)                /**< Shifted mode X1 for PROTIMER_CTRL           */
#define PROTIMER_CTRL_ZEROSTARTEN                        (0x1UL << 5)                                  /**< Start from zero enable                      */
#define _PROTIMER_CTRL_ZEROSTARTEN_SHIFT                 5                                             /**< Shift value for PROTIMER_ZEROSTARTEN        */
#define _PROTIMER_CTRL_ZEROSTARTEN_MASK                  0x20UL                                        /**< Bit mask for PROTIMER_ZEROSTARTEN           */
#define _PROTIMER_CTRL_ZEROSTARTEN_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_ZEROSTARTEN_X0                    0x00000000UL                                  /**< Mode X0 for PROTIMER_CTRL                   */
#define _PROTIMER_CTRL_ZEROSTARTEN_X1                    0x00000001UL                                  /**< Mode X1 for PROTIMER_CTRL                   */
#define PROTIMER_CTRL_ZEROSTARTEN_DEFAULT                (_PROTIMER_CTRL_ZEROSTARTEN_DEFAULT << 5)     /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_ZEROSTARTEN_X0                     (_PROTIMER_CTRL_ZEROSTARTEN_X0 << 5)          /**< Shifted mode X0 for PROTIMER_CTRL           */
#define PROTIMER_CTRL_ZEROSTARTEN_X1                     (_PROTIMER_CTRL_ZEROSTARTEN_X1 << 5)          /**< Shifted mode X1 for PROTIMER_CTRL           */
#define _PROTIMER_CTRL_PRECNTSRC_SHIFT                   8                                             /**< Shift value for PROTIMER_PRECNTSRC          */
#define _PROTIMER_CTRL_PRECNTSRC_MASK                    0x300UL                                       /**< Bit mask for PROTIMER_PRECNTSRC             */
#define _PROTIMER_CTRL_PRECNTSRC_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_PRECNTSRC_DISABLED                0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_PRECNTSRC_CLOCK                   0x00000001UL                                  /**< Mode CLOCK for PROTIMER_CTRL                */
#define _PROTIMER_CTRL_PRECNTSRC_UNUSED0                 0x00000002UL                                  /**< Mode UNUSED0 for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_PRECNTSRC_UNUSED1                 0x00000003UL                                  /**< Mode UNUSED1 for PROTIMER_CTRL              */
#define PROTIMER_CTRL_PRECNTSRC_DEFAULT                  (_PROTIMER_CTRL_PRECNTSRC_DEFAULT << 8)       /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_PRECNTSRC_DISABLED                 (_PROTIMER_CTRL_PRECNTSRC_DISABLED << 8)      /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_PRECNTSRC_CLOCK                    (_PROTIMER_CTRL_PRECNTSRC_CLOCK << 8)         /**< Shifted mode CLOCK for PROTIMER_CTRL        */
#define PROTIMER_CTRL_PRECNTSRC_UNUSED0                  (_PROTIMER_CTRL_PRECNTSRC_UNUSED0 << 8)       /**< Shifted mode UNUSED0 for PROTIMER_CTRL      */
#define PROTIMER_CTRL_PRECNTSRC_UNUSED1                  (_PROTIMER_CTRL_PRECNTSRC_UNUSED1 << 8)       /**< Shifted mode UNUSED1 for PROTIMER_CTRL      */
#define _PROTIMER_CTRL_BASECNTSRC_SHIFT                  12                                            /**< Shift value for PROTIMER_BASECNTSRC         */
#define _PROTIMER_CTRL_BASECNTSRC_MASK                   0x3000UL                                      /**< Bit mask for PROTIMER_BASECNTSRC            */
#define _PROTIMER_CTRL_BASECNTSRC_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_BASECNTSRC_DISABLED               0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_BASECNTSRC_PRECNTOF               0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_BASECNTSRC_UNUSED0                0x00000002UL                                  /**< Mode UNUSED0 for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_BASECNTSRC_UNUSED1                0x00000003UL                                  /**< Mode UNUSED1 for PROTIMER_CTRL              */
#define PROTIMER_CTRL_BASECNTSRC_DEFAULT                 (_PROTIMER_CTRL_BASECNTSRC_DEFAULT << 12)     /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_BASECNTSRC_DISABLED                (_PROTIMER_CTRL_BASECNTSRC_DISABLED << 12)    /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_BASECNTSRC_PRECNTOF                (_PROTIMER_CTRL_BASECNTSRC_PRECNTOF << 12)    /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_BASECNTSRC_UNUSED0                 (_PROTIMER_CTRL_BASECNTSRC_UNUSED0 << 12)     /**< Shifted mode UNUSED0 for PROTIMER_CTRL      */
#define PROTIMER_CTRL_BASECNTSRC_UNUSED1                 (_PROTIMER_CTRL_BASECNTSRC_UNUSED1 << 12)     /**< Shifted mode UNUSED1 for PROTIMER_CTRL      */
#define _PROTIMER_CTRL_WRAPCNTSRC_SHIFT                  16                                            /**< Shift value for PROTIMER_WRAPCNTSRC         */
#define _PROTIMER_CTRL_WRAPCNTSRC_MASK                   0x30000UL                                     /**< Bit mask for PROTIMER_WRAPCNTSRC            */
#define _PROTIMER_CTRL_WRAPCNTSRC_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_WRAPCNTSRC_DISABLED               0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_WRAPCNTSRC_PRECNTOF               0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_WRAPCNTSRC_BASECNTOF              0x00000002UL                                  /**< Mode BASECNTOF for PROTIMER_CTRL            */
#define _PROTIMER_CTRL_WRAPCNTSRC_UNUSED                 0x00000003UL                                  /**< Mode UNUSED for PROTIMER_CTRL               */
#define PROTIMER_CTRL_WRAPCNTSRC_DEFAULT                 (_PROTIMER_CTRL_WRAPCNTSRC_DEFAULT << 16)     /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_WRAPCNTSRC_DISABLED                (_PROTIMER_CTRL_WRAPCNTSRC_DISABLED << 16)    /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_WRAPCNTSRC_PRECNTOF                (_PROTIMER_CTRL_WRAPCNTSRC_PRECNTOF << 16)    /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_WRAPCNTSRC_BASECNTOF               (_PROTIMER_CTRL_WRAPCNTSRC_BASECNTOF << 16)   /**< Shifted mode BASECNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_WRAPCNTSRC_UNUSED                  (_PROTIMER_CTRL_WRAPCNTSRC_UNUSED << 16)      /**< Shifted mode UNUSED for PROTIMER_CTRL       */
#define _PROTIMER_CTRL_TOUT0SRC_SHIFT                    20                                            /**< Shift value for PROTIMER_TOUT0SRC           */
#define _PROTIMER_CTRL_TOUT0SRC_MASK                     0x300000UL                                    /**< Bit mask for PROTIMER_TOUT0SRC              */
#define _PROTIMER_CTRL_TOUT0SRC_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT0SRC_DISABLED                 0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT0SRC_PRECNTOF                 0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT0SRC_BASECNTOF                0x00000002UL                                  /**< Mode BASECNTOF for PROTIMER_CTRL            */
#define _PROTIMER_CTRL_TOUT0SRC_WRAPCNTOF                0x00000003UL                                  /**< Mode WRAPCNTOF for PROTIMER_CTRL            */
#define PROTIMER_CTRL_TOUT0SRC_DEFAULT                   (_PROTIMER_CTRL_TOUT0SRC_DEFAULT << 20)       /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT0SRC_DISABLED                  (_PROTIMER_CTRL_TOUT0SRC_DISABLED << 20)      /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT0SRC_PRECNTOF                  (_PROTIMER_CTRL_TOUT0SRC_PRECNTOF << 20)      /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT0SRC_BASECNTOF                 (_PROTIMER_CTRL_TOUT0SRC_BASECNTOF << 20)     /**< Shifted mode BASECNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_TOUT0SRC_WRAPCNTOF                 (_PROTIMER_CTRL_TOUT0SRC_WRAPCNTOF << 20)     /**< Shifted mode WRAPCNTOF for PROTIMER_CTRL    */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_SHIFT                22                                            /**< Shift value for PROTIMER_TOUT0SYNCSRC       */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_MASK                 0xC00000UL                                    /**< Bit mask for PROTIMER_TOUT0SYNCSRC          */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_DISABLED             0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_PRECNTOF             0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_BASECNTOF            0x00000002UL                                  /**< Mode BASECNTOF for PROTIMER_CTRL            */
#define _PROTIMER_CTRL_TOUT0SYNCSRC_WRAPCNTOF            0x00000003UL                                  /**< Mode WRAPCNTOF for PROTIMER_CTRL            */
#define PROTIMER_CTRL_TOUT0SYNCSRC_DEFAULT               (_PROTIMER_CTRL_TOUT0SYNCSRC_DEFAULT << 22)   /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT0SYNCSRC_DISABLED              (_PROTIMER_CTRL_TOUT0SYNCSRC_DISABLED << 22)  /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT0SYNCSRC_PRECNTOF              (_PROTIMER_CTRL_TOUT0SYNCSRC_PRECNTOF << 22)  /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT0SYNCSRC_BASECNTOF             (_PROTIMER_CTRL_TOUT0SYNCSRC_BASECNTOF << 22) /**< Shifted mode BASECNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_TOUT0SYNCSRC_WRAPCNTOF             (_PROTIMER_CTRL_TOUT0SYNCSRC_WRAPCNTOF << 22) /**< Shifted mode WRAPCNTOF for PROTIMER_CTRL    */
#define _PROTIMER_CTRL_TOUT1SRC_SHIFT                    24                                            /**< Shift value for PROTIMER_TOUT1SRC           */
#define _PROTIMER_CTRL_TOUT1SRC_MASK                     0x3000000UL                                   /**< Bit mask for PROTIMER_TOUT1SRC              */
#define _PROTIMER_CTRL_TOUT1SRC_DEFAULT                  0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT1SRC_DISABLED                 0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT1SRC_PRECNTOF                 0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT1SRC_BASECNTOF                0x00000002UL                                  /**< Mode BASECNTOF for PROTIMER_CTRL            */
#define _PROTIMER_CTRL_TOUT1SRC_WRAPCNTOF                0x00000003UL                                  /**< Mode WRAPCNTOF for PROTIMER_CTRL            */
#define PROTIMER_CTRL_TOUT1SRC_DEFAULT                   (_PROTIMER_CTRL_TOUT1SRC_DEFAULT << 24)       /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT1SRC_DISABLED                  (_PROTIMER_CTRL_TOUT1SRC_DISABLED << 24)      /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT1SRC_PRECNTOF                  (_PROTIMER_CTRL_TOUT1SRC_PRECNTOF << 24)      /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT1SRC_BASECNTOF                 (_PROTIMER_CTRL_TOUT1SRC_BASECNTOF << 24)     /**< Shifted mode BASECNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_TOUT1SRC_WRAPCNTOF                 (_PROTIMER_CTRL_TOUT1SRC_WRAPCNTOF << 24)     /**< Shifted mode WRAPCNTOF for PROTIMER_CTRL    */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_SHIFT                26                                            /**< Shift value for PROTIMER_TOUT1SYNCSRC       */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_MASK                 0xC000000UL                                   /**< Bit mask for PROTIMER_TOUT1SYNCSRC          */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_DISABLED             0x00000000UL                                  /**< Mode DISABLED for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_PRECNTOF             0x00000001UL                                  /**< Mode PRECNTOF for PROTIMER_CTRL             */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_BASECNTOF            0x00000002UL                                  /**< Mode BASECNTOF for PROTIMER_CTRL            */
#define _PROTIMER_CTRL_TOUT1SYNCSRC_WRAPCNTOF            0x00000003UL                                  /**< Mode WRAPCNTOF for PROTIMER_CTRL            */
#define PROTIMER_CTRL_TOUT1SYNCSRC_DEFAULT               (_PROTIMER_CTRL_TOUT1SYNCSRC_DEFAULT << 26)   /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT1SYNCSRC_DISABLED              (_PROTIMER_CTRL_TOUT1SYNCSRC_DISABLED << 26)  /**< Shifted mode DISABLED for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT1SYNCSRC_PRECNTOF              (_PROTIMER_CTRL_TOUT1SYNCSRC_PRECNTOF << 26)  /**< Shifted mode PRECNTOF for PROTIMER_CTRL     */
#define PROTIMER_CTRL_TOUT1SYNCSRC_BASECNTOF             (_PROTIMER_CTRL_TOUT1SYNCSRC_BASECNTOF << 26) /**< Shifted mode BASECNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_TOUT1SYNCSRC_WRAPCNTOF             (_PROTIMER_CTRL_TOUT1SYNCSRC_WRAPCNTOF << 26) /**< Shifted mode WRAPCNTOF for PROTIMER_CTRL    */
#define PROTIMER_CTRL_TOUT0MODE                          (0x1UL << 28)                                 /**< Repeat Mode                                 */
#define _PROTIMER_CTRL_TOUT0MODE_SHIFT                   28                                            /**< Shift value for PROTIMER_TOUT0MODE          */
#define _PROTIMER_CTRL_TOUT0MODE_MASK                    0x10000000UL                                  /**< Bit mask for PROTIMER_TOUT0MODE             */
#define _PROTIMER_CTRL_TOUT0MODE_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT0MODE_FREE                    0x00000000UL                                  /**< Mode FREE for PROTIMER_CTRL                 */
#define _PROTIMER_CTRL_TOUT0MODE_ONESHOT                 0x00000001UL                                  /**< Mode ONESHOT for PROTIMER_CTRL              */
#define PROTIMER_CTRL_TOUT0MODE_DEFAULT                  (_PROTIMER_CTRL_TOUT0MODE_DEFAULT << 28)      /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT0MODE_FREE                     (_PROTIMER_CTRL_TOUT0MODE_FREE << 28)         /**< Shifted mode FREE for PROTIMER_CTRL         */
#define PROTIMER_CTRL_TOUT0MODE_ONESHOT                  (_PROTIMER_CTRL_TOUT0MODE_ONESHOT << 28)      /**< Shifted mode ONESHOT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT1MODE                          (0x1UL << 29)                                 /**< Repeat Mode                                 */
#define _PROTIMER_CTRL_TOUT1MODE_SHIFT                   29                                            /**< Shift value for PROTIMER_TOUT1MODE          */
#define _PROTIMER_CTRL_TOUT1MODE_MASK                    0x20000000UL                                  /**< Bit mask for PROTIMER_TOUT1MODE             */
#define _PROTIMER_CTRL_TOUT1MODE_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_CTRL              */
#define _PROTIMER_CTRL_TOUT1MODE_FREE                    0x00000000UL                                  /**< Mode FREE for PROTIMER_CTRL                 */
#define _PROTIMER_CTRL_TOUT1MODE_ONESHOT                 0x00000001UL                                  /**< Mode ONESHOT for PROTIMER_CTRL              */
#define PROTIMER_CTRL_TOUT1MODE_DEFAULT                  (_PROTIMER_CTRL_TOUT1MODE_DEFAULT << 29)      /**< Shifted mode DEFAULT for PROTIMER_CTRL      */
#define PROTIMER_CTRL_TOUT1MODE_FREE                     (_PROTIMER_CTRL_TOUT1MODE_FREE << 29)         /**< Shifted mode FREE for PROTIMER_CTRL         */
#define PROTIMER_CTRL_TOUT1MODE_ONESHOT                  (_PROTIMER_CTRL_TOUT1MODE_ONESHOT << 29)      /**< Shifted mode ONESHOT for PROTIMER_CTRL      */

