SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_protimer.h
/* Bit fields for PROTIMER STATUS */
#define _PROTIMER_STATUS_RESETVALUE                      0x00000000UL                                 /**< Default value for PROTIMER_STATUS           */
#define _PROTIMER_STATUS_MASK                            0x0000FFFFUL                                 /**< Mask for PROTIMER_STATUS                    */
#define PROTIMER_STATUS_RUNNING                          (0x1UL << 0)                                 /**< Running                                     */
#define _PROTIMER_STATUS_RUNNING_SHIFT                   0                                            /**< Shift value for PROTIMER_RUNNING            */
#define _PROTIMER_STATUS_RUNNING_MASK                    0x1UL                                        /**< Bit mask for PROTIMER_RUNNING               */
#define _PROTIMER_STATUS_RUNNING_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_RUNNING_DEFAULT                  (_PROTIMER_STATUS_RUNNING_DEFAULT << 0)      /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_LBTSYNC                          (0x1UL << 1)                                 /**< LBT Synchronizing                           */
#define _PROTIMER_STATUS_LBTSYNC_SHIFT                   1                                            /**< Shift value for PROTIMER_LBTSYNC            */
#define _PROTIMER_STATUS_LBTSYNC_MASK                    0x2UL                                        /**< Bit mask for PROTIMER_LBTSYNC               */
#define _PROTIMER_STATUS_LBTSYNC_DEFAULT                 0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_LBTSYNC_DEFAULT                  (_PROTIMER_STATUS_LBTSYNC_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_LBTRUNNING                       (0x1UL << 2)                                 /**< LBT Running                                 */
#define _PROTIMER_STATUS_LBTRUNNING_SHIFT                2                                            /**< Shift value for PROTIMER_LBTRUNNING         */
#define _PROTIMER_STATUS_LBTRUNNING_MASK                 0x4UL                                        /**< Bit mask for PROTIMER_LBTRUNNING            */
#define _PROTIMER_STATUS_LBTRUNNING_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_LBTRUNNING_DEFAULT               (_PROTIMER_STATUS_LBTRUNNING_DEFAULT << 2)   /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_LBTPAUSED                        (0x1UL << 3)                                 /**< LBT has been paused.                        */
#define _PROTIMER_STATUS_LBTPAUSED_SHIFT                 3                                            /**< Shift value for PROTIMER_LBTPAUSED          */
#define _PROTIMER_STATUS_LBTPAUSED_MASK                  0x8UL                                        /**< Bit mask for PROTIMER_LBTPAUSED             */
#define _PROTIMER_STATUS_LBTPAUSED_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_LBTPAUSED_DEFAULT                (_PROTIMER_STATUS_LBTPAUSED_DEFAULT << 3)    /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_TOUT0RUNNING                     (0x1UL << 4)                                 /**< Timeout Counter 0 Running                   */
#define _PROTIMER_STATUS_TOUT0RUNNING_SHIFT              4                                            /**< Shift value for PROTIMER_TOUT0RUNNING       */
#define _PROTIMER_STATUS_TOUT0RUNNING_MASK               0x10UL                                       /**< Bit mask for PROTIMER_TOUT0RUNNING          */
#define _PROTIMER_STATUS_TOUT0RUNNING_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_TOUT0RUNNING_DEFAULT             (_PROTIMER_STATUS_TOUT0RUNNING_DEFAULT << 4) /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_TOUT0SYNC                        (0x1UL << 5)                                 /**< Timeout Counter 0 Synchronizing             */
#define _PROTIMER_STATUS_TOUT0SYNC_SHIFT                 5                                            /**< Shift value for PROTIMER_TOUT0SYNC          */
#define _PROTIMER_STATUS_TOUT0SYNC_MASK                  0x20UL                                       /**< Bit mask for PROTIMER_TOUT0SYNC             */
#define _PROTIMER_STATUS_TOUT0SYNC_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_TOUT0SYNC_DEFAULT                (_PROTIMER_STATUS_TOUT0SYNC_DEFAULT << 5)    /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_TOUT1RUNNING                     (0x1UL << 6)                                 /**< Timeout Counter 1 Running                   */
#define _PROTIMER_STATUS_TOUT1RUNNING_SHIFT              6                                            /**< Shift value for PROTIMER_TOUT1RUNNING       */
#define _PROTIMER_STATUS_TOUT1RUNNING_MASK               0x40UL                                       /**< Bit mask for PROTIMER_TOUT1RUNNING          */
#define _PROTIMER_STATUS_TOUT1RUNNING_DEFAULT            0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_TOUT1RUNNING_DEFAULT             (_PROTIMER_STATUS_TOUT1RUNNING_DEFAULT << 6) /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_TOUT1SYNC                        (0x1UL << 7)                                 /**< Timeout Counter 1 Synchronizing             */
#define _PROTIMER_STATUS_TOUT1SYNC_SHIFT                 7                                            /**< Shift value for PROTIMER_TOUT1SYNC          */
#define _PROTIMER_STATUS_TOUT1SYNC_MASK                  0x80UL                                       /**< Bit mask for PROTIMER_TOUT1SYNC             */
#define _PROTIMER_STATUS_TOUT1SYNC_DEFAULT               0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_TOUT1SYNC_DEFAULT                (_PROTIMER_STATUS_TOUT1SYNC_DEFAULT << 7)    /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV0                             (0x1UL << 8)                                 /**< CC0 Capture Valid                           */
#define _PROTIMER_STATUS_ICV0_SHIFT                      8                                            /**< Shift value for PROTIMER_ICV0               */
#define _PROTIMER_STATUS_ICV0_MASK                       0x100UL                                      /**< Bit mask for PROTIMER_ICV0                  */
#define _PROTIMER_STATUS_ICV0_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define _PROTIMER_STATUS_ICV0_X0                         0x00000000UL                                 /**< Mode X0 for PROTIMER_STATUS                 */
#define _PROTIMER_STATUS_ICV0_X1                         0x00000001UL                                 /**< Mode X1 for PROTIMER_STATUS                 */
#define PROTIMER_STATUS_ICV0_DEFAULT                     (_PROTIMER_STATUS_ICV0_DEFAULT << 8)         /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV0_X0                          (_PROTIMER_STATUS_ICV0_X0 << 8)              /**< Shifted mode X0 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV0_X1                          (_PROTIMER_STATUS_ICV0_X1 << 8)              /**< Shifted mode X1 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV1                             (0x1UL << 9)                                 /**< CC1 Capture Valid                           */
#define _PROTIMER_STATUS_ICV1_SHIFT                      9                                            /**< Shift value for PROTIMER_ICV1               */
#define _PROTIMER_STATUS_ICV1_MASK                       0x200UL                                      /**< Bit mask for PROTIMER_ICV1                  */
#define _PROTIMER_STATUS_ICV1_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define _PROTIMER_STATUS_ICV1_X0                         0x00000000UL                                 /**< Mode X0 for PROTIMER_STATUS                 */
#define _PROTIMER_STATUS_ICV1_X1                         0x00000001UL                                 /**< Mode X1 for PROTIMER_STATUS                 */
#define PROTIMER_STATUS_ICV1_DEFAULT                     (_PROTIMER_STATUS_ICV1_DEFAULT << 9)         /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV1_X0                          (_PROTIMER_STATUS_ICV1_X0 << 9)              /**< Shifted mode X0 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV1_X1                          (_PROTIMER_STATUS_ICV1_X1 << 9)              /**< Shifted mode X1 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV2                             (0x1UL << 10)                                /**< CC2 Capture Valid                           */
#define _PROTIMER_STATUS_ICV2_SHIFT                      10                                           /**< Shift value for PROTIMER_ICV2               */
#define _PROTIMER_STATUS_ICV2_MASK                       0x400UL                                      /**< Bit mask for PROTIMER_ICV2                  */
#define _PROTIMER_STATUS_ICV2_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define _PROTIMER_STATUS_ICV2_X0                         0x00000000UL                                 /**< Mode X0 for PROTIMER_STATUS                 */
#define _PROTIMER_STATUS_ICV2_X1                         0x00000001UL                                 /**< Mode X1 for PROTIMER_STATUS                 */
#define PROTIMER_STATUS_ICV2_DEFAULT                     (_PROTIMER_STATUS_ICV2_DEFAULT << 10)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV2_X0                          (_PROTIMER_STATUS_ICV2_X0 << 10)             /**< Shifted mode X0 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV2_X1                          (_PROTIMER_STATUS_ICV2_X1 << 10)             /**< Shifted mode X1 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV3                             (0x1UL << 11)                                /**< CC3 Capture Valid                           */
#define _PROTIMER_STATUS_ICV3_SHIFT                      11                                           /**< Shift value for PROTIMER_ICV3               */
#define _PROTIMER_STATUS_ICV3_MASK                       0x800UL                                      /**< Bit mask for PROTIMER_ICV3                  */
#define _PROTIMER_STATUS_ICV3_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define _PROTIMER_STATUS_ICV3_X0                         0x00000000UL                                 /**< Mode X0 for PROTIMER_STATUS                 */
#define _PROTIMER_STATUS_ICV3_X1                         0x00000001UL                                 /**< Mode X1 for PROTIMER_STATUS                 */
#define PROTIMER_STATUS_ICV3_DEFAULT                     (_PROTIMER_STATUS_ICV3_DEFAULT << 11)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV3_X0                          (_PROTIMER_STATUS_ICV3_X0 << 11)             /**< Shifted mode X0 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV3_X1                          (_PROTIMER_STATUS_ICV3_X1 << 11)             /**< Shifted mode X1 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV4                             (0x1UL << 12)                                /**< CC4 Capture Valid                           */
#define _PROTIMER_STATUS_ICV4_SHIFT                      12                                           /**< Shift value for PROTIMER_ICV4               */
#define _PROTIMER_STATUS_ICV4_MASK                       0x1000UL                                     /**< Bit mask for PROTIMER_ICV4                  */
#define _PROTIMER_STATUS_ICV4_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define _PROTIMER_STATUS_ICV4_X0                         0x00000000UL                                 /**< Mode X0 for PROTIMER_STATUS                 */
#define _PROTIMER_STATUS_ICV4_X1                         0x00000001UL                                 /**< Mode X1 for PROTIMER_STATUS                 */
#define PROTIMER_STATUS_ICV4_DEFAULT                     (_PROTIMER_STATUS_ICV4_DEFAULT << 12)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV4_X0                          (_PROTIMER_STATUS_ICV4_X0 << 12)             /**< Shifted mode X0 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV4_X1                          (_PROTIMER_STATUS_ICV4_X1 << 12)             /**< Shifted mode X1 for PROTIMER_STATUS         */
#define PROTIMER_STATUS_ICV5                             (0x1UL << 13)                                /**< CC5 Capture Valid                           */
#define _PROTIMER_STATUS_ICV5_SHIFT                      13                                           /**< Shift value for PROTIMER_ICV5               */
#define _PROTIMER_STATUS_ICV5_MASK                       0x2000UL                                     /**< Bit mask for PROTIMER_ICV5                  */
#define _PROTIMER_STATUS_ICV5_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_ICV5_DEFAULT                     (_PROTIMER_STATUS_ICV5_DEFAULT << 13)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV6                             (0x1UL << 14)                                /**< CC6 Capture Valid                           */
#define _PROTIMER_STATUS_ICV6_SHIFT                      14                                           /**< Shift value for PROTIMER_ICV6               */
#define _PROTIMER_STATUS_ICV6_MASK                       0x4000UL                                     /**< Bit mask for PROTIMER_ICV6                  */
#define _PROTIMER_STATUS_ICV6_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_ICV6_DEFAULT                     (_PROTIMER_STATUS_ICV6_DEFAULT << 14)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */
#define PROTIMER_STATUS_ICV7                             (0x1UL << 15)                                /**< CC7 Capture Valid                           */
#define _PROTIMER_STATUS_ICV7_SHIFT                      15                                           /**< Shift value for PROTIMER_ICV7               */
#define _PROTIMER_STATUS_ICV7_MASK                       0x8000UL                                     /**< Bit mask for PROTIMER_ICV7                  */
#define _PROTIMER_STATUS_ICV7_DEFAULT                    0x00000000UL                                 /**< Mode DEFAULT for PROTIMER_STATUS            */
#define PROTIMER_STATUS_ICV7_DEFAULT                     (_PROTIMER_STATUS_ICV7_DEFAULT << 15)        /**< Shifted mode DEFAULT for PROTIMER_STATUS    */

/* Bit fields for PROTIMER PRECNT */
#define _PROTIMER_PRECNT_RESETVALUE                      0x00000000UL                           /**< Default value for PROTIMER_PRECNT           */
#define _PROTIMER_PRECNT_MASK                            0x0000FFFFUL                           /**< Mask for PROTIMER_PRECNT                    */
#define _PROTIMER_PRECNT_PRECNT_SHIFT                    0                                      /**< Shift value for PROTIMER_PRECNT             */
#define _PROTIMER_PRECNT_PRECNT_MASK                     0xFFFFUL                               /**< Bit mask for PROTIMER_PRECNT                */
#define _PROTIMER_PRECNT_PRECNT_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for PROTIMER_PRECNT            */
#define PROTIMER_PRECNT_PRECNT_DEFAULT                   (_PROTIMER_PRECNT_PRECNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_PRECNT    */

/* Bit fields for PROTIMER BASECNT */
#define _PROTIMER_BASECNT_RESETVALUE                     0x00000000UL                             /**< Default value for PROTIMER_BASECNT          */
#define _PROTIMER_BASECNT_MASK                           0x0000FFFFUL                             /**< Mask for PROTIMER_BASECNT                   */
#define _PROTIMER_BASECNT_BASECNT_SHIFT                  0                                        /**< Shift value for PROTIMER_BASECNT            */
#define _PROTIMER_BASECNT_BASECNT_MASK                   0xFFFFUL                                 /**< Bit mask for PROTIMER_BASECNT               */
#define _PROTIMER_BASECNT_BASECNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for PROTIMER_BASECNT           */
#define PROTIMER_BASECNT_BASECNT_DEFAULT                 (_PROTIMER_BASECNT_BASECNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_BASECNT   */

/* Bit fields for PROTIMER WRAPCNT */
#define _PROTIMER_WRAPCNT_RESETVALUE                     0x00000000UL                             /**< Default value for PROTIMER_WRAPCNT          */
#define _PROTIMER_WRAPCNT_MASK                           0xFFFFFFFFUL                             /**< Mask for PROTIMER_WRAPCNT                   */
#define _PROTIMER_WRAPCNT_WRAPCNT_SHIFT                  0                                        /**< Shift value for PROTIMER_WRAPCNT            */
#define _PROTIMER_WRAPCNT_WRAPCNT_MASK                   0xFFFFFFFFUL                             /**< Bit mask for PROTIMER_WRAPCNT               */
#define _PROTIMER_WRAPCNT_WRAPCNT_DEFAULT                0x00000000UL                             /**< Mode DEFAULT for PROTIMER_WRAPCNT           */
#define PROTIMER_WRAPCNT_WRAPCNT_DEFAULT                 (_PROTIMER_WRAPCNT_WRAPCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_WRAPCNT   */

/* Bit fields for PROTIMER BASEPRE */
#define _PROTIMER_BASEPRE_RESETVALUE                     0x00000000UL                               /**< Default value for PROTIMER_BASEPRE          */
#define _PROTIMER_BASEPRE_MASK                           0xFFFFFFFFUL                               /**< Mask for PROTIMER_BASEPRE                   */
#define _PROTIMER_BASEPRE_PRECNTV_SHIFT                  0                                          /**< Shift value for PROTIMER_PRECNTV            */
#define _PROTIMER_BASEPRE_PRECNTV_MASK                   0xFFFFUL                                   /**< Bit mask for PROTIMER_PRECNTV               */
#define _PROTIMER_BASEPRE_PRECNTV_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for PROTIMER_BASEPRE           */
#define PROTIMER_BASEPRE_PRECNTV_DEFAULT                 (_PROTIMER_BASEPRE_PRECNTV_DEFAULT << 0)   /**< Shifted mode DEFAULT for PROTIMER_BASEPRE   */
#define _PROTIMER_BASEPRE_BASECNTV_SHIFT                 16                                         /**< Shift value for PROTIMER_BASECNTV           */
#define _PROTIMER_BASEPRE_BASECNTV_MASK                  0xFFFF0000UL                               /**< Bit mask for PROTIMER_BASECNTV              */
#define _PROTIMER_BASEPRE_BASECNTV_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for PROTIMER_BASEPRE           */
#define PROTIMER_BASEPRE_BASECNTV_DEFAULT                (_PROTIMER_BASEPRE_BASECNTV_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_BASEPRE   */

/* Bit fields for PROTIMER LWRAPCNT */
#define _PROTIMER_LWRAPCNT_RESETVALUE                    0x00000000UL                               /**< Default value for PROTIMER_LWRAPCNT         */
#define _PROTIMER_LWRAPCNT_MASK                          0xFFFFFFFFUL                               /**< Mask for PROTIMER_LWRAPCNT                  */
#define _PROTIMER_LWRAPCNT_LWRAPCNT_SHIFT                0                                          /**< Shift value for PROTIMER_LWRAPCNT           */
#define _PROTIMER_LWRAPCNT_LWRAPCNT_MASK                 0xFFFFFFFFUL                               /**< Bit mask for PROTIMER_LWRAPCNT              */
#define _PROTIMER_LWRAPCNT_LWRAPCNT_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PROTIMER_LWRAPCNT          */
#define PROTIMER_LWRAPCNT_LWRAPCNT_DEFAULT               (_PROTIMER_LWRAPCNT_LWRAPCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_LWRAPCNT  */

/* Bit fields for PROTIMER PRECNTTOPADJ */
#define _PROTIMER_PRECNTTOPADJ_RESETVALUE                0x00000000UL                                       /**< Default value for PROTIMER_PRECNTTOPADJ     */
#define _PROTIMER_PRECNTTOPADJ_MASK                      0x0000FFFFUL                                       /**< Mask for PROTIMER_PRECNTTOPADJ              */
#define _PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_SHIFT        0                                                  /**< Shift value for PROTIMER_PRECNTTOPADJ       */
#define _PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_MASK         0xFFFFUL                                           /**< Bit mask for PROTIMER_PRECNTTOPADJ          */
#define _PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_DEFAULT      0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_PRECNTTOPADJ      */
#define PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_DEFAULT       (_PROTIMER_PRECNTTOPADJ_PRECNTTOPADJ_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_PRECNTTOPADJ*/

/* Bit fields for PROTIMER PRECNTTOP */
#define _PROTIMER_PRECNTTOP_RESETVALUE                   0x00FFFF00UL                                     /**< Default value for PROTIMER_PRECNTTOP        */
#define _PROTIMER_PRECNTTOP_MASK                         0x00FFFFFFUL                                     /**< Mask for PROTIMER_PRECNTTOP                 */
#define _PROTIMER_PRECNTTOP_PRECNTTOPFRAC_SHIFT          0                                                /**< Shift value for PROTIMER_PRECNTTOPFRAC      */
#define _PROTIMER_PRECNTTOP_PRECNTTOPFRAC_MASK           0xFFUL                                           /**< Bit mask for PROTIMER_PRECNTTOPFRAC         */
#define _PROTIMER_PRECNTTOP_PRECNTTOPFRAC_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for PROTIMER_PRECNTTOP         */
#define PROTIMER_PRECNTTOP_PRECNTTOPFRAC_DEFAULT         (_PROTIMER_PRECNTTOP_PRECNTTOPFRAC_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_PRECNTTOP */
#define _PROTIMER_PRECNTTOP_PRECNTTOP_SHIFT              8                                                /**< Shift value for PROTIMER_PRECNTTOP          */
#define _PROTIMER_PRECNTTOP_PRECNTTOP_MASK               0xFFFF00UL                                       /**< Bit mask for PROTIMER_PRECNTTOP             */
#define _PROTIMER_PRECNTTOP_PRECNTTOP_DEFAULT            0x0000FFFFUL                                     /**< Mode DEFAULT for PROTIMER_PRECNTTOP         */
#define PROTIMER_PRECNTTOP_PRECNTTOP_DEFAULT             (_PROTIMER_PRECNTTOP_PRECNTTOP_DEFAULT << 8)     /**< Shifted mode DEFAULT for PROTIMER_PRECNTTOP */

