SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_protimer.h
/* Bit fields for PROTIMER LBTPRSCTRL */
#define _PROTIMER_LBTPRSCTRL_RESETVALUE                  0x00000000UL                                       /**< Default value for PROTIMER_LBTPRSCTRL       */
#define _PROTIMER_LBTPRSCTRL_MASK                        0x01010100UL                                       /**< Mask for PROTIMER_LBTPRSCTRL                */
#define PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN                (0x1UL << 8)                                       /**< Enable LBT start commands from PRS.         */
#define _PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_SHIFT         8                                                  /**< Shift value for PROTIMER_LBTSTARTPRSEN      */
#define _PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_MASK          0x100UL                                            /**< Bit mask for PROTIMER_LBTSTARTPRSEN         */
#define _PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_DEFAULT       0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_LBTPRSCTRL        */
#define PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_DEFAULT        (_PROTIMER_LBTPRSCTRL_LBTSTARTPRSEN_DEFAULT << 8)  /**< Shifted mode DEFAULT for PROTIMER_LBTPRSCTRL*/
#define PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN                (0x1UL << 16)                                      /**< Enable LBT pause commands from PRS.         */
#define _PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_SHIFT         16                                                 /**< Shift value for PROTIMER_LBTPAUSEPRSEN      */
#define _PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_MASK          0x10000UL                                          /**< Bit mask for PROTIMER_LBTPAUSEPRSEN         */
#define _PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_DEFAULT       0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_LBTPRSCTRL        */
#define PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_DEFAULT        (_PROTIMER_LBTPRSCTRL_LBTPAUSEPRSEN_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_LBTPRSCTRL*/
#define PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN                 (0x1UL << 24)                                      /**< Enable LBT stop commands from PRS.          */
#define _PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_SHIFT          24                                                 /**< Shift value for PROTIMER_LBTSTOPPRSEN       */
#define _PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_MASK           0x1000000UL                                        /**< Bit mask for PROTIMER_LBTSTOPPRSEN          */
#define _PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_DEFAULT        0x00000000UL                                       /**< Mode DEFAULT for PROTIMER_LBTPRSCTRL        */
#define PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_DEFAULT         (_PROTIMER_LBTPRSCTRL_LBTSTOPPRSEN_DEFAULT << 24)  /**< Shifted mode DEFAULT for PROTIMER_LBTPRSCTRL*/

/* Bit fields for PROTIMER LBTSTATE */
#define _PROTIMER_LBTSTATE_RESETVALUE                    0x00000000UL                                /**< Default value for PROTIMER_LBTSTATE         */
#define _PROTIMER_LBTSTATE_MASK                          0xFFFFFFFFUL                                /**< Mask for PROTIMER_LBTSTATE                  */
#define _PROTIMER_LBTSTATE_TOUT0PCNT_SHIFT               0                                           /**< Shift value for PROTIMER_TOUT0PCNT          */
#define _PROTIMER_LBTSTATE_TOUT0PCNT_MASK                0xFFFFUL                                    /**< Bit mask for PROTIMER_TOUT0PCNT             */
#define _PROTIMER_LBTSTATE_TOUT0PCNT_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for PROTIMER_LBTSTATE          */
#define PROTIMER_LBTSTATE_TOUT0PCNT_DEFAULT              (_PROTIMER_LBTSTATE_TOUT0PCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_LBTSTATE  */
#define _PROTIMER_LBTSTATE_TOUT0CNT_SHIFT                16                                          /**< Shift value for PROTIMER_TOUT0CNT           */
#define _PROTIMER_LBTSTATE_TOUT0CNT_MASK                 0xFFFF0000UL                                /**< Bit mask for PROTIMER_TOUT0CNT              */
#define _PROTIMER_LBTSTATE_TOUT0CNT_DEFAULT              0x00000000UL                                /**< Mode DEFAULT for PROTIMER_LBTSTATE          */
#define PROTIMER_LBTSTATE_TOUT0CNT_DEFAULT               (_PROTIMER_LBTSTATE_TOUT0CNT_DEFAULT << 16) /**< Shifted mode DEFAULT for PROTIMER_LBTSTATE  */

/* Bit fields for PROTIMER RANDOM */
#define _PROTIMER_RANDOM_RESETVALUE                      0x00000000UL                           /**< Default value for PROTIMER_RANDOM           */
#define _PROTIMER_RANDOM_MASK                            0x0000FFFFUL                           /**< Mask for PROTIMER_RANDOM                    */
#define _PROTIMER_RANDOM_RANDOM_SHIFT                    0                                      /**< Shift value for PROTIMER_RANDOM             */
#define _PROTIMER_RANDOM_RANDOM_MASK                     0xFFFFUL                               /**< Bit mask for PROTIMER_RANDOM                */
#define _PROTIMER_RANDOM_RANDOM_DEFAULT                  0x00000000UL                           /**< Mode DEFAULT for PROTIMER_RANDOM            */
#define PROTIMER_RANDOM_RANDOM_DEFAULT                   (_PROTIMER_RANDOM_RANDOM_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_RANDOM    */

/* Bit fields for PROTIMER IF */
#define _PROTIMER_IF_RESETVALUE                          0x00000000UL                               /**< Default value for PROTIMER_IF               */
#define _PROTIMER_IF_MASK                                0x3FFFFFF7UL                               /**< Mask for PROTIMER_IF                        */
#define PROTIMER_IF_PRECNTOF                             (0x1UL << 0)                               /**< PRECNT Overflow Interrupt Flag              */
#define _PROTIMER_IF_PRECNTOF_SHIFT                      0                                          /**< Shift value for PROTIMER_PRECNTOF           */
#define _PROTIMER_IF_PRECNTOF_MASK                       0x1UL                                      /**< Bit mask for PROTIMER_PRECNTOF              */
#define _PROTIMER_IF_PRECNTOF_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_PRECNTOF_DEFAULT                     (_PROTIMER_IF_PRECNTOF_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_BASECNTOF                            (0x1UL << 1)                               /**< BASECNT Overflow Interrupt Flag             */
#define _PROTIMER_IF_BASECNTOF_SHIFT                     1                                          /**< Shift value for PROTIMER_BASECNTOF          */
#define _PROTIMER_IF_BASECNTOF_MASK                      0x2UL                                      /**< Bit mask for PROTIMER_BASECNTOF             */
#define _PROTIMER_IF_BASECNTOF_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_BASECNTOF_DEFAULT                    (_PROTIMER_IF_BASECNTOF_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_WRAPCNTOF                            (0x1UL << 2)                               /**< WRAPCNT Overflow Interrupt Flag             */
#define _PROTIMER_IF_WRAPCNTOF_SHIFT                     2                                          /**< Shift value for PROTIMER_WRAPCNTOF          */
#define _PROTIMER_IF_WRAPCNTOF_MASK                      0x4UL                                      /**< Bit mask for PROTIMER_WRAPCNTOF             */
#define _PROTIMER_IF_WRAPCNTOF_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_WRAPCNTOF_DEFAULT                    (_PROTIMER_IF_WRAPCNTOF_DEFAULT << 2)      /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_TOUT0                                (0x1UL << 4)                               /**< TOUT0 underflow interrupt flag              */
#define _PROTIMER_IF_TOUT0_SHIFT                         4                                          /**< Shift value for PROTIMER_TOUT0              */
#define _PROTIMER_IF_TOUT0_MASK                          0x10UL                                     /**< Bit mask for PROTIMER_TOUT0                 */
#define _PROTIMER_IF_TOUT0_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_TOUT0_DEFAULT                        (_PROTIMER_IF_TOUT0_DEFAULT << 4)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_TOUT1                                (0x1UL << 5)                               /**< TOUT1 underflow interrupt flag              */
#define _PROTIMER_IF_TOUT1_SHIFT                         5                                          /**< Shift value for PROTIMER_TOUT1              */
#define _PROTIMER_IF_TOUT1_MASK                          0x20UL                                     /**< Bit mask for PROTIMER_TOUT1                 */
#define _PROTIMER_IF_TOUT1_DEFAULT                       0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_TOUT1_DEFAULT                        (_PROTIMER_IF_TOUT1_DEFAULT << 5)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_TOUT0MATCH                           (0x1UL << 6)                               /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_IF_TOUT0MATCH_SHIFT                    6                                          /**< Shift value for PROTIMER_TOUT0MATCH         */
#define _PROTIMER_IF_TOUT0MATCH_MASK                     0x40UL                                     /**< Bit mask for PROTIMER_TOUT0MATCH            */
#define _PROTIMER_IF_TOUT0MATCH_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_TOUT0MATCH_DEFAULT                   (_PROTIMER_IF_TOUT0MATCH_DEFAULT << 6)     /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_TOUT1MATCH                           (0x1UL << 7)                               /**< TOUT1 compare match interrupt flag          */
#define _PROTIMER_IF_TOUT1MATCH_SHIFT                    7                                          /**< Shift value for PROTIMER_TOUT1MATCH         */
#define _PROTIMER_IF_TOUT1MATCH_MASK                     0x80UL                                     /**< Bit mask for PROTIMER_TOUT1MATCH            */
#define _PROTIMER_IF_TOUT1MATCH_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_TOUT1MATCH_DEFAULT                   (_PROTIMER_IF_TOUT1MATCH_DEFAULT << 7)     /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC0                                  (0x1UL << 8)                               /**< CC Channel 0 Interrupt Flag                 */
#define _PROTIMER_IF_CC0_SHIFT                           8                                          /**< Shift value for PROTIMER_CC0                */
#define _PROTIMER_IF_CC0_MASK                            0x100UL                                    /**< Bit mask for PROTIMER_CC0                   */
#define _PROTIMER_IF_CC0_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC0_DEFAULT                          (_PROTIMER_IF_CC0_DEFAULT << 8)            /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC1                                  (0x1UL << 9)                               /**< CC Channel 1 Interrupt Flag                 */
#define _PROTIMER_IF_CC1_SHIFT                           9                                          /**< Shift value for PROTIMER_CC1                */
#define _PROTIMER_IF_CC1_MASK                            0x200UL                                    /**< Bit mask for PROTIMER_CC1                   */
#define _PROTIMER_IF_CC1_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC1_DEFAULT                          (_PROTIMER_IF_CC1_DEFAULT << 9)            /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC2                                  (0x1UL << 10)                              /**< CC Channel 2 Interrupt Flag                 */
#define _PROTIMER_IF_CC2_SHIFT                           10                                         /**< Shift value for PROTIMER_CC2                */
#define _PROTIMER_IF_CC2_MASK                            0x400UL                                    /**< Bit mask for PROTIMER_CC2                   */
#define _PROTIMER_IF_CC2_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC2_DEFAULT                          (_PROTIMER_IF_CC2_DEFAULT << 10)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC3                                  (0x1UL << 11)                              /**< CC Channel 3 Interrupt Flag                 */
#define _PROTIMER_IF_CC3_SHIFT                           11                                         /**< Shift value for PROTIMER_CC3                */
#define _PROTIMER_IF_CC3_MASK                            0x800UL                                    /**< Bit mask for PROTIMER_CC3                   */
#define _PROTIMER_IF_CC3_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC3_DEFAULT                          (_PROTIMER_IF_CC3_DEFAULT << 11)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC4                                  (0x1UL << 12)                              /**< CC Channel 4 Interrupt Flag                 */
#define _PROTIMER_IF_CC4_SHIFT                           12                                         /**< Shift value for PROTIMER_CC4                */
#define _PROTIMER_IF_CC4_MASK                            0x1000UL                                   /**< Bit mask for PROTIMER_CC4                   */
#define _PROTIMER_IF_CC4_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC4_DEFAULT                          (_PROTIMER_IF_CC4_DEFAULT << 12)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC5                                  (0x1UL << 13)                              /**< CC Channel 5 Interrupt Flag                 */
#define _PROTIMER_IF_CC5_SHIFT                           13                                         /**< Shift value for PROTIMER_CC5                */
#define _PROTIMER_IF_CC5_MASK                            0x2000UL                                   /**< Bit mask for PROTIMER_CC5                   */
#define _PROTIMER_IF_CC5_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC5_DEFAULT                          (_PROTIMER_IF_CC5_DEFAULT << 13)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC6                                  (0x1UL << 14)                              /**< CC Channel 6 Interrupt Flag                 */
#define _PROTIMER_IF_CC6_SHIFT                           14                                         /**< Shift value for PROTIMER_CC6                */
#define _PROTIMER_IF_CC6_MASK                            0x4000UL                                   /**< Bit mask for PROTIMER_CC6                   */
#define _PROTIMER_IF_CC6_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC6_DEFAULT                          (_PROTIMER_IF_CC6_DEFAULT << 14)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_CC7                                  (0x1UL << 15)                              /**< CC Channel 7 Interrupt Flag                 */
#define _PROTIMER_IF_CC7_SHIFT                           15                                         /**< Shift value for PROTIMER_CC7                */
#define _PROTIMER_IF_CC7_MASK                            0x8000UL                                   /**< Bit mask for PROTIMER_CC7                   */
#define _PROTIMER_IF_CC7_DEFAULT                         0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_CC7_DEFAULT                          (_PROTIMER_IF_CC7_DEFAULT << 15)           /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF0                                 (0x1UL << 16)                              /**< CC Channel 0 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF0_SHIFT                          16                                         /**< Shift value for PROTIMER_COF0               */
#define _PROTIMER_IF_COF0_MASK                           0x10000UL                                  /**< Bit mask for PROTIMER_COF0                  */
#define _PROTIMER_IF_COF0_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF0_DEFAULT                         (_PROTIMER_IF_COF0_DEFAULT << 16)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF1                                 (0x1UL << 17)                              /**< CC Channel 1 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF1_SHIFT                          17                                         /**< Shift value for PROTIMER_COF1               */
#define _PROTIMER_IF_COF1_MASK                           0x20000UL                                  /**< Bit mask for PROTIMER_COF1                  */
#define _PROTIMER_IF_COF1_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF1_DEFAULT                         (_PROTIMER_IF_COF1_DEFAULT << 17)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF2                                 (0x1UL << 18)                              /**< CC Channel 2 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF2_SHIFT                          18                                         /**< Shift value for PROTIMER_COF2               */
#define _PROTIMER_IF_COF2_MASK                           0x40000UL                                  /**< Bit mask for PROTIMER_COF2                  */
#define _PROTIMER_IF_COF2_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF2_DEFAULT                         (_PROTIMER_IF_COF2_DEFAULT << 18)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF3                                 (0x1UL << 19)                              /**< CC Channel 3 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF3_SHIFT                          19                                         /**< Shift value for PROTIMER_COF3               */
#define _PROTIMER_IF_COF3_MASK                           0x80000UL                                  /**< Bit mask for PROTIMER_COF3                  */
#define _PROTIMER_IF_COF3_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF3_DEFAULT                         (_PROTIMER_IF_COF3_DEFAULT << 19)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF4                                 (0x1UL << 20)                              /**< CC Channel 4 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF4_SHIFT                          20                                         /**< Shift value for PROTIMER_COF4               */
#define _PROTIMER_IF_COF4_MASK                           0x100000UL                                 /**< Bit mask for PROTIMER_COF4                  */
#define _PROTIMER_IF_COF4_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF4_DEFAULT                         (_PROTIMER_IF_COF4_DEFAULT << 20)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF5                                 (0x1UL << 21)                              /**< CC Channel 5 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF5_SHIFT                          21                                         /**< Shift value for PROTIMER_COF5               */
#define _PROTIMER_IF_COF5_MASK                           0x200000UL                                 /**< Bit mask for PROTIMER_COF5                  */
#define _PROTIMER_IF_COF5_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF5_DEFAULT                         (_PROTIMER_IF_COF5_DEFAULT << 21)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF6                                 (0x1UL << 22)                              /**< CC Channel 6 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF6_SHIFT                          22                                         /**< Shift value for PROTIMER_COF6               */
#define _PROTIMER_IF_COF6_MASK                           0x400000UL                                 /**< Bit mask for PROTIMER_COF6                  */
#define _PROTIMER_IF_COF6_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF6_DEFAULT                         (_PROTIMER_IF_COF6_DEFAULT << 22)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_COF7                                 (0x1UL << 23)                              /**< CC Channel 7 Overflow Interrupt Flag        */
#define _PROTIMER_IF_COF7_SHIFT                          23                                         /**< Shift value for PROTIMER_COF7               */
#define _PROTIMER_IF_COF7_MASK                           0x800000UL                                 /**< Bit mask for PROTIMER_COF7                  */
#define _PROTIMER_IF_COF7_DEFAULT                        0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_COF7_DEFAULT                         (_PROTIMER_IF_COF7_DEFAULT << 23)          /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_LBTSUCCESS                           (0x1UL << 24)                              /**< Listen Before Talk Success                  */
#define _PROTIMER_IF_LBTSUCCESS_SHIFT                    24                                         /**< Shift value for PROTIMER_LBTSUCCESS         */
#define _PROTIMER_IF_LBTSUCCESS_MASK                     0x1000000UL                                /**< Bit mask for PROTIMER_LBTSUCCESS            */
#define _PROTIMER_IF_LBTSUCCESS_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_LBTSUCCESS_DEFAULT                   (_PROTIMER_IF_LBTSUCCESS_DEFAULT << 24)    /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_LBTFAILURE                           (0x1UL << 25)                              /**< Listen Before Talk Failure                  */
