SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/MGM22/Include/mgm22_protimer.h
/* Bit fields for PROTIMER RANDOMFW2 */
#define _PROTIMER_RANDOMFW2_RESETVALUE                   0x00000000UL                               /**< Default value for PROTIMER_RANDOMFW2        */
#define _PROTIMER_RANDOMFW2_MASK                         0x0003FFFFUL                               /**< Mask for PROTIMER_RANDOMFW2                 */
#define _PROTIMER_RANDOMFW2_RANDOM6_SHIFT                0                                          /**< Shift value for PROTIMER_RANDOM6            */
#define _PROTIMER_RANDOMFW2_RANDOM6_MASK                 0x1FFUL                                    /**< Bit mask for PROTIMER_RANDOM6               */
#define _PROTIMER_RANDOMFW2_RANDOM6_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PROTIMER_RANDOMFW2         */
#define PROTIMER_RANDOMFW2_RANDOM6_DEFAULT               (_PROTIMER_RANDOMFW2_RANDOM6_DEFAULT << 0) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW2 */
#define _PROTIMER_RANDOMFW2_RANDOM7_SHIFT                9                                          /**< Shift value for PROTIMER_RANDOM7            */
#define _PROTIMER_RANDOMFW2_RANDOM7_MASK                 0x3FE00UL                                  /**< Bit mask for PROTIMER_RANDOM7               */
#define _PROTIMER_RANDOMFW2_RANDOM7_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for PROTIMER_RANDOMFW2         */
#define PROTIMER_RANDOMFW2_RANDOM7_DEFAULT               (_PROTIMER_RANDOMFW2_RANDOM7_DEFAULT << 9) /**< Shifted mode DEFAULT for PROTIMER_RANDOMFW2 */

/* Bit fields for PROTIMER SEQIF */
#define _PROTIMER_SEQIF_RESETVALUE                       0x00000000UL                                  /**< Default value for PROTIMER_SEQIF            */
#define _PROTIMER_SEQIF_MASK                             0x3FFFFFF7UL                                  /**< Mask for PROTIMER_SEQIF                     */
#define PROTIMER_SEQIF_PRECNTOF                          (0x1UL << 0)                                  /**< PRECNT Overflow Interrupt Flag              */
#define _PROTIMER_SEQIF_PRECNTOF_SHIFT                   0                                             /**< Shift value for PROTIMER_PRECNTOF           */
#define _PROTIMER_SEQIF_PRECNTOF_MASK                    0x1UL                                         /**< Bit mask for PROTIMER_PRECNTOF              */
#define _PROTIMER_SEQIF_PRECNTOF_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_PRECNTOF_DEFAULT                  (_PROTIMER_SEQIF_PRECNTOF_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_BASECNTOF                         (0x1UL << 1)                                  /**< BASECNT Overflow Interrupt Flag             */
#define _PROTIMER_SEQIF_BASECNTOF_SHIFT                  1                                             /**< Shift value for PROTIMER_BASECNTOF          */
#define _PROTIMER_SEQIF_BASECNTOF_MASK                   0x2UL                                         /**< Bit mask for PROTIMER_BASECNTOF             */
#define _PROTIMER_SEQIF_BASECNTOF_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_BASECNTOF_DEFAULT                 (_PROTIMER_SEQIF_BASECNTOF_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_WRAPCNTOF                         (0x1UL << 2)                                  /**< WRAPCNT Overflow Interrupt Flag             */
#define _PROTIMER_SEQIF_WRAPCNTOF_SHIFT                  2                                             /**< Shift value for PROTIMER_WRAPCNTOF          */
#define _PROTIMER_SEQIF_WRAPCNTOF_MASK                   0x4UL                                         /**< Bit mask for PROTIMER_WRAPCNTOF             */
#define _PROTIMER_SEQIF_WRAPCNTOF_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_WRAPCNTOF_DEFAULT                 (_PROTIMER_SEQIF_WRAPCNTOF_DEFAULT << 2)      /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_TOUT0                             (0x1UL << 4)                                  /**< TOUT0 underflow interrupt flag              */
#define _PROTIMER_SEQIF_TOUT0_SHIFT                      4                                             /**< Shift value for PROTIMER_TOUT0              */
#define _PROTIMER_SEQIF_TOUT0_MASK                       0x10UL                                        /**< Bit mask for PROTIMER_TOUT0                 */
#define _PROTIMER_SEQIF_TOUT0_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_TOUT0_DEFAULT                     (_PROTIMER_SEQIF_TOUT0_DEFAULT << 4)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_TOUT1                             (0x1UL << 5)                                  /**< TOUT1 underflow interrupt flag              */
#define _PROTIMER_SEQIF_TOUT1_SHIFT                      5                                             /**< Shift value for PROTIMER_TOUT1              */
#define _PROTIMER_SEQIF_TOUT1_MASK                       0x20UL                                        /**< Bit mask for PROTIMER_TOUT1                 */
#define _PROTIMER_SEQIF_TOUT1_DEFAULT                    0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_TOUT1_DEFAULT                     (_PROTIMER_SEQIF_TOUT1_DEFAULT << 5)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_TOUT0MATCH                        (0x1UL << 6)                                  /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_SEQIF_TOUT0MATCH_SHIFT                 6                                             /**< Shift value for PROTIMER_TOUT0MATCH         */
#define _PROTIMER_SEQIF_TOUT0MATCH_MASK                  0x40UL                                        /**< Bit mask for PROTIMER_TOUT0MATCH            */
#define _PROTIMER_SEQIF_TOUT0MATCH_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_TOUT0MATCH_DEFAULT                (_PROTIMER_SEQIF_TOUT0MATCH_DEFAULT << 6)     /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_TOUT1MATCH                        (0x1UL << 7)                                  /**< TOUT1 compare match interrupt flag          */
#define _PROTIMER_SEQIF_TOUT1MATCH_SHIFT                 7                                             /**< Shift value for PROTIMER_TOUT1MATCH         */
#define _PROTIMER_SEQIF_TOUT1MATCH_MASK                  0x80UL                                        /**< Bit mask for PROTIMER_TOUT1MATCH            */
#define _PROTIMER_SEQIF_TOUT1MATCH_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_TOUT1MATCH_DEFAULT                (_PROTIMER_SEQIF_TOUT1MATCH_DEFAULT << 7)     /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC0                               (0x1UL << 8)                                  /**< CC Channel 0 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC0_SHIFT                        8                                             /**< Shift value for PROTIMER_CC0                */
#define _PROTIMER_SEQIF_CC0_MASK                         0x100UL                                       /**< Bit mask for PROTIMER_CC0                   */
#define _PROTIMER_SEQIF_CC0_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC0_DEFAULT                       (_PROTIMER_SEQIF_CC0_DEFAULT << 8)            /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC1                               (0x1UL << 9)                                  /**< CC Channel 1 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC1_SHIFT                        9                                             /**< Shift value for PROTIMER_CC1                */
#define _PROTIMER_SEQIF_CC1_MASK                         0x200UL                                       /**< Bit mask for PROTIMER_CC1                   */
#define _PROTIMER_SEQIF_CC1_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC1_DEFAULT                       (_PROTIMER_SEQIF_CC1_DEFAULT << 9)            /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC2                               (0x1UL << 10)                                 /**< CC Channel 2 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC2_SHIFT                        10                                            /**< Shift value for PROTIMER_CC2                */
#define _PROTIMER_SEQIF_CC2_MASK                         0x400UL                                       /**< Bit mask for PROTIMER_CC2                   */
#define _PROTIMER_SEQIF_CC2_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC2_DEFAULT                       (_PROTIMER_SEQIF_CC2_DEFAULT << 10)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC3                               (0x1UL << 11)                                 /**< CC Channel 3 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC3_SHIFT                        11                                            /**< Shift value for PROTIMER_CC3                */
#define _PROTIMER_SEQIF_CC3_MASK                         0x800UL                                       /**< Bit mask for PROTIMER_CC3                   */
#define _PROTIMER_SEQIF_CC3_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC3_DEFAULT                       (_PROTIMER_SEQIF_CC3_DEFAULT << 11)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC4                               (0x1UL << 12)                                 /**< CC Channel 4 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC4_SHIFT                        12                                            /**< Shift value for PROTIMER_CC4                */
#define _PROTIMER_SEQIF_CC4_MASK                         0x1000UL                                      /**< Bit mask for PROTIMER_CC4                   */
#define _PROTIMER_SEQIF_CC4_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC4_DEFAULT                       (_PROTIMER_SEQIF_CC4_DEFAULT << 12)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC5                               (0x1UL << 13)                                 /**< CC Channel 5 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC5_SHIFT                        13                                            /**< Shift value for PROTIMER_CC5                */
#define _PROTIMER_SEQIF_CC5_MASK                         0x2000UL                                      /**< Bit mask for PROTIMER_CC5                   */
#define _PROTIMER_SEQIF_CC5_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC5_DEFAULT                       (_PROTIMER_SEQIF_CC5_DEFAULT << 13)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC6                               (0x1UL << 14)                                 /**< CC Channel 6 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC6_SHIFT                        14                                            /**< Shift value for PROTIMER_CC6                */
#define _PROTIMER_SEQIF_CC6_MASK                         0x4000UL                                      /**< Bit mask for PROTIMER_CC6                   */
#define _PROTIMER_SEQIF_CC6_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC6_DEFAULT                       (_PROTIMER_SEQIF_CC6_DEFAULT << 14)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_CC7                               (0x1UL << 15)                                 /**< CC Channel 7 Interrupt Flag                 */
#define _PROTIMER_SEQIF_CC7_SHIFT                        15                                            /**< Shift value for PROTIMER_CC7                */
#define _PROTIMER_SEQIF_CC7_MASK                         0x8000UL                                      /**< Bit mask for PROTIMER_CC7                   */
#define _PROTIMER_SEQIF_CC7_DEFAULT                      0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_CC7_DEFAULT                       (_PROTIMER_SEQIF_CC7_DEFAULT << 15)           /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF0                              (0x1UL << 16)                                 /**< CC Channel 0 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF0_SHIFT                       16                                            /**< Shift value for PROTIMER_COF0               */
#define _PROTIMER_SEQIF_COF0_MASK                        0x10000UL                                     /**< Bit mask for PROTIMER_COF0                  */
#define _PROTIMER_SEQIF_COF0_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF0_DEFAULT                      (_PROTIMER_SEQIF_COF0_DEFAULT << 16)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF1                              (0x1UL << 17)                                 /**< CC Channel 1 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF1_SHIFT                       17                                            /**< Shift value for PROTIMER_COF1               */
#define _PROTIMER_SEQIF_COF1_MASK                        0x20000UL                                     /**< Bit mask for PROTIMER_COF1                  */
#define _PROTIMER_SEQIF_COF1_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF1_DEFAULT                      (_PROTIMER_SEQIF_COF1_DEFAULT << 17)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF2                              (0x1UL << 18)                                 /**< CC Channel 2 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF2_SHIFT                       18                                            /**< Shift value for PROTIMER_COF2               */
#define _PROTIMER_SEQIF_COF2_MASK                        0x40000UL                                     /**< Bit mask for PROTIMER_COF2                  */
#define _PROTIMER_SEQIF_COF2_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF2_DEFAULT                      (_PROTIMER_SEQIF_COF2_DEFAULT << 18)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF3                              (0x1UL << 19)                                 /**< CC Channel 3 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF3_SHIFT                       19                                            /**< Shift value for PROTIMER_COF3               */
#define _PROTIMER_SEQIF_COF3_MASK                        0x80000UL                                     /**< Bit mask for PROTIMER_COF3                  */
#define _PROTIMER_SEQIF_COF3_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF3_DEFAULT                      (_PROTIMER_SEQIF_COF3_DEFAULT << 19)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF4                              (0x1UL << 20)                                 /**< CC Channel 4 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF4_SHIFT                       20                                            /**< Shift value for PROTIMER_COF4               */
#define _PROTIMER_SEQIF_COF4_MASK                        0x100000UL                                    /**< Bit mask for PROTIMER_COF4                  */
#define _PROTIMER_SEQIF_COF4_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF4_DEFAULT                      (_PROTIMER_SEQIF_COF4_DEFAULT << 20)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF5                              (0x1UL << 21)                                 /**< CC Channel 5 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF5_SHIFT                       21                                            /**< Shift value for PROTIMER_COF5               */
#define _PROTIMER_SEQIF_COF5_MASK                        0x200000UL                                    /**< Bit mask for PROTIMER_COF5                  */
#define _PROTIMER_SEQIF_COF5_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF5_DEFAULT                      (_PROTIMER_SEQIF_COF5_DEFAULT << 21)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF6                              (0x1UL << 22)                                 /**< CC Channel 6 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF6_SHIFT                       22                                            /**< Shift value for PROTIMER_COF6               */
#define _PROTIMER_SEQIF_COF6_MASK                        0x400000UL                                    /**< Bit mask for PROTIMER_COF6                  */
#define _PROTIMER_SEQIF_COF6_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF6_DEFAULT                      (_PROTIMER_SEQIF_COF6_DEFAULT << 22)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_COF7                              (0x1UL << 23)                                 /**< CC Channel 7 Overflow Interrupt Flag        */
#define _PROTIMER_SEQIF_COF7_SHIFT                       23                                            /**< Shift value for PROTIMER_COF7               */
#define _PROTIMER_SEQIF_COF7_MASK                        0x800000UL                                    /**< Bit mask for PROTIMER_COF7                  */
#define _PROTIMER_SEQIF_COF7_DEFAULT                     0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_COF7_DEFAULT                      (_PROTIMER_SEQIF_COF7_DEFAULT << 23)          /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_LBTSUCCESS                        (0x1UL << 24)                                 /**< Listen Before Talk Success                  */
#define _PROTIMER_SEQIF_LBTSUCCESS_SHIFT                 24                                            /**< Shift value for PROTIMER_LBTSUCCESS         */
#define _PROTIMER_SEQIF_LBTSUCCESS_MASK                  0x1000000UL                                   /**< Bit mask for PROTIMER_LBTSUCCESS            */
#define _PROTIMER_SEQIF_LBTSUCCESS_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_LBTSUCCESS_DEFAULT                (_PROTIMER_SEQIF_LBTSUCCESS_DEFAULT << 24)    /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_LBTFAILURE                        (0x1UL << 25)                                 /**< Listen Before Talk Failure                  */
#define _PROTIMER_SEQIF_LBTFAILURE_SHIFT                 25                                            /**< Shift value for PROTIMER_LBTFAILURE         */
#define _PROTIMER_SEQIF_LBTFAILURE_MASK                  0x2000000UL                                   /**< Bit mask for PROTIMER_LBTFAILURE            */
#define _PROTIMER_SEQIF_LBTFAILURE_DEFAULT               0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_LBTFAILURE_DEFAULT                (_PROTIMER_SEQIF_LBTFAILURE_DEFAULT << 25)    /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_LBTPAUSED                         (0x1UL << 26)                                 /**< Listen Before Talk Paused                   */
#define _PROTIMER_SEQIF_LBTPAUSED_SHIFT                  26                                            /**< Shift value for PROTIMER_LBTPAUSED          */
#define _PROTIMER_SEQIF_LBTPAUSED_MASK                   0x4000000UL                                   /**< Bit mask for PROTIMER_LBTPAUSED             */
#define _PROTIMER_SEQIF_LBTPAUSED_DEFAULT                0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_LBTPAUSED_DEFAULT                 (_PROTIMER_SEQIF_LBTPAUSED_DEFAULT << 26)     /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_LBTRETRY                          (0x1UL << 27)                                 /**< Listen Before Talk Retry                    */
#define _PROTIMER_SEQIF_LBTRETRY_SHIFT                   27                                            /**< Shift value for PROTIMER_LBTRETRY           */
#define _PROTIMER_SEQIF_LBTRETRY_MASK                    0x8000000UL                                   /**< Bit mask for PROTIMER_LBTRETRY              */
#define _PROTIMER_SEQIF_LBTRETRY_DEFAULT                 0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_LBTRETRY_DEFAULT                  (_PROTIMER_SEQIF_LBTRETRY_DEFAULT << 27)      /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_RTCCSYNCHED                       (0x1UL << 28)                                 /**< PROTIMER synchronized with the RTCC         */
#define _PROTIMER_SEQIF_RTCCSYNCHED_SHIFT                28                                            /**< Shift value for PROTIMER_RTCCSYNCHED        */
#define _PROTIMER_SEQIF_RTCCSYNCHED_MASK                 0x10000000UL                                  /**< Bit mask for PROTIMER_RTCCSYNCHED           */
#define _PROTIMER_SEQIF_RTCCSYNCHED_DEFAULT              0x00000000UL                                  /**< Mode DEFAULT for PROTIMER_SEQIF             */
#define PROTIMER_SEQIF_RTCCSYNCHED_DEFAULT               (_PROTIMER_SEQIF_RTCCSYNCHED_DEFAULT << 28)   /**< Shifted mode DEFAULT for PROTIMER_SEQIF     */
#define PROTIMER_SEQIF_TOUT0MATCHLBT                     (0x1UL << 29)                                 /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_SEQIF_TOUT0MATCHLBT_SHIFT              29                                            /**< Shift value for PROTIMER_TOUT0MATCHLBT      */
